code-review/NRB_3471_3546/База_Стало/Reports/СверкаЦБсНРДДепозитарий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаЦБсНРДДепозитарий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТолькоРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанныхДепозитария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРасхождение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФильтрПоРазделамСчетовДепоМХ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрПоРазделамСчетовДепоМХЛокальный</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФильтрПоРазделамСчетовДепоМХЭталон</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/СверкаЦБсНРДДепозитарий/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаСервере
Перем мТекущийОбъектНаСервере; // Реквизит формы "Отчет", преобразованный в объект прикладного типа

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.ДатаСверки = ОбщегоНазначения.ПредыдущийРабочийДень(ТекущаяДатаСеанса());
	
	УстановитьВидимость();
	
	ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ТекущийОбъект());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отчет.ВариантСверки = "ДепозитарийНРД";
	
	ВариантСверкиПриИзменении("");
	
	Отчет.ИсточникДанныхДепозитария = "ФайловыйШлюз";
	
	ВосстановитьНастройкиНаСервере("ДепозитарийБэкофис"); // BSLLS:Typo-off
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗавершениеРаботы Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СохранитьНастройкиНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Выберите каталог с файлами НРД";
	Диалог.Каталог = Отчет.КаталогФайлов;
	Диалог.ПредварительныйПросмотр = Ложь;
	
	ВозвращаемоеЗначение = Диалог.Выбрать();
	Если ВозвращаемоеЗначение Тогда
		Отчет.КаталогФайлов = РаботаСФайлами.ПолучитьАбсолютныйПуть(Диалог.Каталог);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСверкиПриИзменении(Элемент)
	
	Если Отчет.ВариантСверки = "ДепозитарийБэкофис" Тогда // BSLLS:Typo-off
		
		Элементы.КаталогФайлов.Доступность = Ложь;
		
	Иначе
		
		Элементы.КаталогФайлов.Доступность = отчет.ИсточникДанныхДепозитария = "КаталогФайлов";
		
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьСверку(Команда)
	
	ВремяСтарта = ТекущаяДатаСеансаНаСервере();
	
	Попытка
		СекундВМинуте = 60;
		ВыполнитьСверкуНаСервере();
		// Отчитаемся по скорости выполнения
		ВсегоСекундЗатрачено = ТекущаяДатаСеансаНаСервере() - ВремяСтарта;
		ВсегоМинут = Цел(ВсегоСекундЗатрачено / СекундВМинуте);
		ВсегоСекунд = ВсегоСекундЗатрачено - ВсегоМинут * СекундВМинуте;
		ТекстПояснения = "Время выполнения: "
			+ ?(ВсегоМинут = 0, "", Строка(ВсегоМинут) + " мин") 
			+ ?(ВсегоСекунд = 0, "", Строка(ВсегоСекунд) + " сек");
		
		ПоказатьОповещениеПользователя("Отчет сверки готов!", , ТекстПояснения, БиблиотекаКартинок.Информация32);
		
	Исключение
		
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьОповещениеПользователя("Ошибка выполнения", , ПодробноеПредставлениеОшибки, БиблиотекаКартинок.Внимание);
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСверкуНаСервере()
	
	ТекущийОбъект().ВыполнитьСверку();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхДепозитарияПриИзменении(Элемент)
	
	Элементы.КаталогФайлов.Доступность = Отчет.ИсточникДанныхДепозитария = "КаталогФайлов";
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьГлобальныеНастройки(Команда)
	СкопироватьГлобальныеНастройкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьГлобальныеНастройки(Команда)
	ВосстановитьГлобальныеНастройкиНаСервере();
	ОбновитьПредупрежденияНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоРазделамСчетовДепоМХПриИзменении(Элемент)
	
	ОбновитьПредупрежденияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоРазделамСчетовДепоМХПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьПредупрежденияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоРазделамСчетовДепоМХЛокальныйПриИзменении(Элемент)
	
	ОбновитьПредупрежденияНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПоРазделамСчетовДепоМХЛокальныйПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьПредупрежденияНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПредупрежденияНаКлиенте()
	
	Элементы.ДекорацияПредупреждение.Видимость = ФильтрГлобальнойНастройкиИзменен();
	
	УстановитьЗаголовокФильтра();
	
КонецПроцедуры

&НаСервере
Функция ТекущаяДатаСеансаНаСервере()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Если Отчет.ВариантСверки = "ДепозитарийБэкофис" Тогда // BSLLS:Typo-off
		
		Элементы.ГруппаФильтрыПоСчетамДепоМХ.Видимость = Истина;
		
		Элементы.ФильтрПоРазделамСчетовДепоМХЛокальный.Заголовок =
			"Настройки 1С" + " [" + СокрЛП(ПараметрыСеанса.ТекущийПользователь) + "]";
		
	Иначе
		
		Элементы.ГруппаФильтрыПоСчетамДепоМХ.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИмяОтчета()
	
	Возврат "Отчет." + ТекущийОбъект().Метаданные().Имя;
	
КонецФункции

&НаСервере
Функция ТекущийОбъект()
	
	Если мТекущийОбъектНаСервере = Неопределено Тогда
		мТекущийОбъектНаСервере = РеквизитФормыВЗначение("Отчет");
	КонецЕсли;
	
	Возврат мТекущийОбъектНаСервере;
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	
	ИмяОтчета = ИмяОтчета();
	
	ТекущийОбъект().СохранитьНастройки(ИмяОтчета, Отчет.ВариантСверки);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиНаСервере(ВариантСверки)
	
	ИмяОтчета = ИмяОтчета();
	
	ТекущийОбъект().ВосстановитьНастройки(ИмяОтчета, ВариантСверки);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект(), "Отчет");
	
	УстановитьЗаголовокФильтра();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФильтра()
	
	Фильтр1С = ОбщегоНазначения.ВыгрузитьКолонку(Отчет.ФильтрПоРазделамСчетовДепоМХЛокальный.Выгрузить(), "РазделСчетаДепоМХ", Истина);
	Если ЗначениеЗаполнено(Фильтр1С) Тогда
		ОписаниеФильтра1С = СтрСоединить(Фильтр1С, ",");
	Иначе
		ОписаниеФильтра1С = "По всем разделам счетов МХ";
	КонецЕсли;
	ФильтрBQ = ОбщегоНазначения.ВыгрузитьКолонку(Отчет.ФильтрПоРазделамСчетовДепоМХ.Выгрузить()			, "РазделСчетаДепоМХ", Истина);
	Если ЗначениеЗаполнено(ФильтрBQ) Тогда
		ОписаниеФильтраBQ = СтрСоединить(ФильтрBQ, ",");
	Иначе
		ОписаниеФильтраBQ = "По всем разделам счетов МХ";
	КонецЕсли;
	
	ШаблонФильтра = "1С: %1;" + Символы.ПС + " BQ: %2";
	ЗаголовокФильтра = СтрШаблон(ШаблонФильтра, ОписаниеФильтра1С, ОписаниеФильтраBQ);
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьГлобальныеНастройкиНаСервере()
	
	Отчет.ФильтрПоРазделамСчетовДепоМХЛокальный.Загрузить(Отчет.ФильтрПоРазделамСчетовДепоМХ.Выгрузить());
	
	УстановитьЗаголовокФильтра();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьГлобальныеНастройкиНаСервере()
	
	Отчет.ФильтрПоРазделамСчетовДепоМХ.Загрузить(Отчет.ФильтрПоРазделамСчетовДепоМХЭталон.Выгрузить());
	
	УстановитьЗаголовокФильтра();
	
КонецПроцедуры

&НаСервере
Функция ФильтрГлобальнойНастройкиИзменен()
	
	Возврат Не ОбщегоНазначения.ДанныеСовпадают(
		Отчет.ФильтрПоРазделамСчетовДепоМХ.Выгрузить(, "РазделСчетаДепоМХ"),
		Отчет.ФильтрПоРазделамСчетовДепоМХЭталон.Выгрузить(, "РазделСчетаДепоМХ"));
	
КонецФункции

#КонецОбласти
